---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BalusterPlacement Properties
BalusterPlacement Class See Also Send Feedback
---

The BalusterPlacement type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | BalusterPattern | Accesses the object containing properties related to the baluster pattern. |
|  | BalusterPerTreadFamilyId | The id of baluster per tread family. |
|  | BalusterPerTreadNumber | The number of balusters per tread. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PostPattern | Accesses the object containing properties related to the post pattern. |
|  | UseBalusterPerTreadOnStairs | If true, one or more balusters will be included on each tread of an associated stair. If false, this is not guaranteed to happen. |

# See Also

BalusterPlacement Class

Autodesk.Revit.DB.Architecture Namespace